Repository: groundstack-org/frsupersized
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# constants.subcategory.settings_general
source: Settings General
de: Einstellungen Allgemein

# constants.subcategory.settings_fullbackground
source: Settings Full background
de: Einstellungen Vollhintergrund

# constants.subcategory.settings_slideshow
source: Settings Slideshow
de: Einstellungen Slideshow

# constants.subcategory.settings_banner
source: Settings Banner
de: Einstellungen Banner

# constants.subcategory.view
source: Pathes to Templates
de: Pfade zu den Templates

# constants.subcategory.view.templateRootPath
source: Path to template root
de: Pfad zum Template Root

# constants.subcategory.view.partialRootPath
source: Path to partial templates
de: Pfad zu den Partial Templates

# constants.subcategory.view.layoutRootPath
source: Path to layout templates
de: Pfad zu den Layout Templates

# pi1_plus_wiz_description
source: Frsupersized implements the Supersized jQuery Plugin - a full screen background slideshow
de: Frsupersized fügt das Supersized jQuery Plugin ein - eine Vollbild-Hintergrund-Slideshow

# tt_content.pi_flexform.from_ts
source: From Typoscript
de: von Typoscript

# tt_content.pi_flexform.yes
source: Yes
de: Ja

# tt_content.pi_flexform.no
source: No
de: Nein

# tt_content.pi_flexform.general
source: General
de: Allgemein

# tt_content.pi_flexform.fullbackground
source: Full Background
de: Vollhintergrund

# tt_content.pi_flexform.field.settings.general.switchControllerAction
source: Show:
de: Zeige:

# tt_content.pi_flexform.field.settings.general.slides
source: Image file(s) for full background, slideshow or banner
de: Bild-Datei(en) für Vollhintergrund, Slideshow oder Banner

# tt_content.pi_flexform.field.settings.general.slidesDescription
source: Files must be located in /uploads/tx_frsupersized/. Single filenames must be delimited by new lines or comma.
de: Dateien müssen im /uploads/tx_frsupersized/ Verzeichnis abgelegt werden. Einzelne Dateinamen müssen durch einen Zeilenumbruch oder ein Komma separiert werden.

# tt_content.pi_flexform.field.settings.general.slideCaptions
source: Slide captions
de: Bildunterschriften

# tt_content.pi_flexform.field.settings.general.slideUrl
source: Link images to following URL (slideshow only)
de: Verlinke Bilder mit den folgenden URL (nur bei der Slideshow)

# tt_content.pi_flexform.field.settings.general.cssCoreFile
source: CSS core file for full background (optional)
de: CSS-Datei für Vollhintergrund (optional)

# tt_content.pi_flexform.field.settings.general.cssSlideshowFile
source: CSS file for slideshow (optional)
de: CSS-Datei für Slideshow (optional)

# tt_content.pi_flexform.field.settings.general.cssBannerFile
source: CSS file for banner (optional)
de: CSS-Datei für Banner (optional)

# tt_content.pi_flexform.field.settings.general.cssThemeFile
source: CSS theme file for slideshow (optional)
de: CSS-theme-Datei für Slideshow (optional)

# tt_content.pi_flexform.field.settings.general.jQueryDisable
source: Disable including of JQuery files (you have to include them externally)
de: Deaktiviere die Einbindung der JQuery-Dateien (Sie müssen sie dann extern einbinden)

# tt_content.pi_flexform.field.settings.general.jQueryFile
source: JQuery file (optional)
de: JQuery-Datei (optional)

# tt_content.pi_flexform.field.settings.general.jQueryEasingFile
source: JQuery easing file (optional)
de: JQuery-Easing-Datei (optional)

# tt_content.pi_flexform.field.settings.general.supersizedJavascriptDisable
source: Disable including of Supersized javascript files (you have to include them externally)
de: Deaktiviere die Einbindung der Supersized-Javascript-Dateien (Sie müssen sie dann extern einbinden)

# tt_content.pi_flexform.field.settings.general.supersizedCoreFile
source: Javascript file for full background(optional)
de: Javascript-Datei für Vollhintergrund (optional)

# tt_content.pi_flexform.field.settings.general.supersizedSlideshowFile
source: Javascript file for slideshow (optional)
de: Javascript-Datei für Slideshow (optional)

# tt_content.pi_flexform.field.settings.general.themeFile
source: Javascript theme file for slideshow (optional)
de: Javascript-theme-Datei für Slideshow (optional)

# tt_content.pi_flexform.field.settings.fullbackground.minWidth
source: Min-Width of slides (in pixels)(min_width)
de: Minimal-Breite der Bilder in Pixel (min_width)

# tt_content.pi_flexform.field.settings.fullbackground.minHeight
source: Min-Height of slides (in pixels)(min_height)
de: Minimal-Höhe der Bilder in Pixel (min_height)

# tt_content.pi_flexform.field.settings.fullbackground.verticalCenter
source: Center images vertically. (vertical_center)
de: Bilder vertikal zentrieren (vertical_center)

# tt_content.pi_flexform.field.settings.fullbackground.horizontalCenter
source: Center images horizontally. (horizontal_center)
de: Bilder horizontal zentrieren (horizontal_center)

# tt_content.pi_flexform.field.settings.fullbackground.fitAlways
source: Image will never exceed browser width or height (Ignores min. dimensions) (fit_always)
de: Das Bild wird niemals die Browser-Breite oder Höhe überschreiten (Ignoriert Minimal-Dimensionen) (fit_always)

# tt_content.pi_flexform.field.settings.fullbackground.fitPortrait
source: Portrait images will not exceed browser height (fit_portrait)
de: Hochformatige Bilder werden die Browser-Höhe nicht überschreiten (fit_portrait)

# tt_content.pi_flexform.field.settings.fullbackground.fitLandscape
source: Landscape images will not exceed browser width (fit_landscape)
de: Querformatige Bilder werden die Browser-Breite nicht überschreiten (fit_landscape)

# tt_content.pi_flexform.field.settings.slideshow.slideshow
source: Activate slideshow (slideshow)
de: Slideshow aktivieren. Ohne Aktivierung werden die folgenden Einstellungen ignoriert. (slideshow)

# tt_content.pi_flexform.field.settings.slideshow.autoplay
source: Start Slideshow directly (autoplay)
de: Slideshow direkt starten (autoplay)

# tt_content.pi_flexform.field.settings.slideshow.slideInterval
source: Time between slide changes in milliseconds. The default is 5 seconds.(slide_interval, default: 5000)
de: Zeit zwischen Bildwechseln in Millisekunden (slide_interval, default 5000)

# tt_content.pi_flexform.field.settings.slideshow.startSlide
source: Start slide (0 is random) (start_slide)
de: Starte mit Bild Nummer (0 ist zufällige Auswahl) (start_slide)

# tt_content.pi_flexform.field.settings.slideshow.stopLoop
source: Pauses slideshow on last slide (stop_loop)
de: Pausiert die Slideshow beim letzten Bild (stop_loop)

# tt_content.pi_flexform.field.settings.slideshow.random
source: Randomize slide order (Ignores start slide - random)
de: Zufällige Bildreihenfolge (Ignoriert start_slide) (random)

# tt_content.pi_flexform.field.settings.slideshow.transition
source: Transition Mode (transition)
de: Übergang-Modus (transition)

# tt_content.pi_flexform.field.settings.slideshow.transition.none
source: No transition effect (none)
de: kein Übergangs-Effekt (none)

# tt_content.pi_flexform.field.settings.slideshow.transition.fade
source: Fade effect (Default)(fade)
de: blenden (fade)

# tt_content.pi_flexform.field.settings.slideshow.transition.slideTop
source: Slide in from top (slideTop)
de: von oben hereingleiten (slide top)

# tt_content.pi_flexform.field.settings.slideshow.transition.slideRight
source: Slide in from right (slideRight)
de: von rechts hereingleiten (slide right)

# tt_content.pi_flexform.field.settings.slideshow.transition.slideBottom
source: Slide in from bottom (slideBottom)
de: von unten hereingleiten (slide bottom)

# tt_content.pi_flexform.field.settings.slideshow.transition.slideLeft
source: Slide in from left(slideLeft)
de: von links hereingleiten (slide left)

# tt_content.pi_flexform.field.settings.slideshow.transition.carouselRight
source: Carousel from right to left (carouselRight)
de: Karussell von rechts nach links (carouselRight)

# tt_content.pi_flexform.field.settings.slideshow.transition.carouselLeft
source: Carousel from left to right (carouselLeft)
de: Karussell von links nach rechts (carouselLeft)

# tt_content.pi_flexform.field.settings.slideshow.transitionSpeed
source: Speed of transition in milliseconds (transition_speed)
de: Geschwindigkeit des Übergangs in Millisekunden (transition_speed)

# tt_content.pi_flexform.field.settings.slideshow.newWindow
source: Image links open in new window/tab (new_window)
de: Bilder-Links öffnen in neuem Fenster/Tab (new_window)

# tt_content.pi_flexform.field.settings.slideshow.keyboardNav
source: Activate keyboard navigation (keyboard_nav)
de: Tastatur-Navigation an/aus (keyboard_nav)

# tt_content.pi_flexform.field.settings.slideshow.performance
source: Performance: 0-Normal, 1-Hybrid speed/quality, 2-Optimizes image quality, 3-Optimizes transition speed (Only works for Firefox/IE, not Webkit) (performance)
de: Performance: 0-Normal, 1-Hybrid Geschwindigkeit/Qualitaet, 2-Optimiert Bild-Qualität, 3-Optimiert Übergangsgeschwindigkeit (Funktioniert nur im Firefox/IE, nicht im Webkit (Chrome/Safari)) (performance)

# tt_content.pi_flexform.field.settings.slideshow.performance.1
source: 1-Hybrid speed/quality
de: 1-Hybrid Geschwindigkeit/Qualitaet

# tt_content.pi_flexform.field.settings.slideshow.performance.2
source: 2-Optimizes image quality
de: 2-Optimiert Bild-Qualität

# tt_content.pi_flexform.field.settings.slideshow.performance.3
source: 3-Optimizes transition speed
de: 3-Optimiert Übergangsgeschwindigkeit

# tt_content.pi_flexform.field.settings.slideshow.imageProtect
source: Disables image dragging and right click with Javascript (image_protect)
de: Deaktiviere Bild-Dragging und rechter Klick mit Javascript (image_protect)

# tt_content.pi_flexform.field.settings.slideshow.slideLinks
source: Individual links for each slide (Options: false, 'num', 'name', 'blank') (slide_links)
de: Individuelle Links für jedes Bild (Optionen false, 'num', 'name', 'blank') (slide_links)

# tt_content.pi_flexform.field.settings.slideshow.slideLinks.false
source: Disable slide links (false)
de: Deaktiviere Bilder-Links (false)

# tt_content.pi_flexform.field.settings.slideshow.slideLinks.number
source: Numbers (num)
de: Nummer - default (num)

# tt_content.pi_flexform.field.settings.slideshow.slideLinks.name
source: Title of slide (name)
de: Titel des Bildes (name)

# tt_content.pi_flexform.field.settings.slideshow.slideLinks.blank
source: Links are empty. Allows for background sprites. (blank)
de: Links sind leer. Erlaubt Background Sprites. (blank)

# tt_content.pi_flexform.field.settings.slideshow.pauseHover
source: Pauses slideshow while current image hovered over. (pause_hover)
de: Slideshow anhalten, wenn Maus über Bild (pause_hover)

# tt_content.pi_flexform.field.settings.slideshow.thumbLinks
source: Individual thumb links for each slide (thumb_links)
de: Individuelle Thumb-Links für jedes Bild (thumb_links)

# tt_content.pi_flexform.field.settings.slideshow.thumbWidth
source: Thumb width
de: Thumb-Breite

# tt_content.pi_flexform.field.settings.slideshow.thumbWidthCrop
source: Activate horzontal cropping of thumb
de: Aktiviere horzontal mittiges Beschneiden des Thumbs

# tt_content.pi_flexform.field.settings.slideshow.thumbHeight
source: Thumb height
de: Thumb-Höhe

# tt_content.pi_flexform.field.settings.slideshow.thumbHeightCrop
source: Activate vertikal cropping of thumb
de: Aktiviere vertikal mittiges Beschneiden des Thumbs

# tt_content.pi_flexform.field.settings.slideshow.thumbnailNavigation
source: Thumbnail navigation - previous and next thumbs(thumbnail_navigation)
de: Aktiviere Thumbnail Navigation (thumbnail_navigation)

# tt_content.pi_flexform.field.settings.slideshow.controlBar
source: Activate control bar
de: Aktiviere Controller Leiste unten

# tt_content.pi_flexform.field.settings.slideshow.navigation
source: Arrow navigation (navigation)
de: Aktiviere Pfeil-Navigation (navigation)

# tt_content.pi_flexform.field.settings.slideshow.navigationImagePath
source: Folder of image files for navigation (optional)
de: Verzeichnis der Bild-Dateien für die Navigation (optional)

# tt_content.pi_flexform.field.settings.slideshow.slideCounter
source: Enable the slide counter (slide_counter)
de: Aktiviere Bild-Zähler (slide_counter)

# tt_content.pi_flexform.field.settings.slideshow.slideCaptions
source: Enable slide captions (slide_captions)
de: Aktiviere Bild-Unterschriften (slide_captions)

# tt_content.pi_flexform.field.settings.slideshow.themeShutterProgressBar
source: Theme shutter option: Progress bar that runs based on the the slide interval. (progress_bar)
de: Theme shutter Option: Fortschrittsbalken läuft auf Basis des slide Intervals. (progress_bar)

# tt_content.pi_flexform.field.settings.slideshow.themeShutterMouseScrub
source: Theme shutter option: Makes the thumbnail list navigate left or right based on the mouse location. (mouse_scrub)
de: Theme shutter Option: Die Thumbnail-Liste navigiert links oder rechts basierend auf der Maus-Position. (mouse_scrub)

# tt_content.pi_flexform.field.settings.banner.banner
source: Activate banner
de: Aktiviere Banner (ohne Aktivierung werden die folgenden Einstellungen ignoriert)

# tt_content.pi_flexform.field.settings.banner.bannerWidth
source: Banner width
de: Banner-Breite in Pixel (width, nummerische Angabe)

# tt_content.pi_flexform.field.settings.banner.bannerHeight
source: Banner height
de: Banner-Höhe in Pixel (height, nummerische Angabe)

# tt_content.pi_flexform.field.settings.banner.bannerTop
source: Distance of the banner from the top of the window in pixels (top, numeric)
de: Abstand des Banners vom oberen Fensterrand in Pixel (top, nummerische Angabe)

# tt_content.pi_flexform.field.settings.banner.bannerLeft
source: Distance of the banner from the left edge of the window (left, numeric)
de: Abstand des Banners vom linken Fensterrand in Pixel (left, nummerische Angabe)
